# load data

In [1458]:
import pandas as pd
import numpy as np

In [1459]:
# add some extra random columns with bool values and int values
extra_col1 = np.random.randint(0, 2, (87569, 1), dtype=bool)
extra_col2 = np.random.randn(87569).reshape((87569, 1))
extra_col3 = np.random.randn(87569).reshape((87569, 1))
extra_col4 = np.random.randn(87569).reshape((87569, 1))

In [1460]:
df = pd.read_csv("https://raw.githubusercontent.com"
                 "/CoreyMSchafer/code_snippets/master"
                 "/Python/Matplotlib/02-BarCharts/data.csv",
                 ) # you can specify name of rows directly when loading data, parameter index_col=name of desired column
df["some_column1"] = extra_col1
df["some_column2"] = extra_col2
df["some_column3"] = extra_col3
df["some_column4"] = extra_col4

In [1461]:
df.shape # shape is an attribute, not a method, thats why no parentheses

(87569, 6)

In [1462]:
# terminology:

"series - data of only one column"

"dataframe - data of multiple series"

'dataframe - data of multiple series'

# basic checking of data

In [1463]:
# head will display only limited number of rows and columns,
#   except pd.set_option("display.max_columns", XXX) is set, to specify desired nr of cols and rows
df.head(2)

,Responder_id,LanguagesWorkedWith,some_column1,some_column2,some_column3,some_column4
0,1,HTML/CSS;Java;JavaScript;Python,False,-0.467252,-0.579881,1.138696
1,2,C++;HTML/CSS;Python,False,0.879021,1.336515,-0.811784

In [1464]:
# this is the same as head, but from the end
df.tail(2)

,Responder_id,LanguagesWorkedWith,some_column1,some_column2,some_column3,some_column4
87567,88377,HTML/CSS;JavaScript;Other(s):,True,-1.595947,0.897649,1.086302
87568,88863,Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...,True,-2.222943,-1.031083,0.402583

In [1465]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87569 entries, 0 to 87568
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Responder_id         87569 non-null  int64
 1   LanguagesWorkedWith  87569 non-null  object
 2   some_column1         87569 non-null  bool
 3   some_column2         87569 non-null  float64
 4   some_column3         87569 non-null  float64
 5   some_column4         87569 non-null  float64
dtypes: bool(1), float64(3), int64(1), object(1)
memory usage: 3.4+ MB

In [1466]:
# set custom number of columns to be printed
"""pd.set_option("display.max_columns", 48)"""

# set custom number of rows to be printed
"""pd.set_option("display.max_rows", XXX)"""

'pd.set_option("display.max_rows", XXX)'

In [1467]:
df.head()

,Responder_id,LanguagesWorkedWith,some_column1,some_column2,some_column3,some_column4
0,1,HTML/CSS;Java;JavaScript;Python,False,-0.467252,-0.579881,1.138696
1,2,C++;HTML/CSS;Python,False,0.879021,1.336515,-0.811784
2,3,HTML/CSS,True,-0.918523,-1.037106,1.232620
3,4,C;C++;C#;Python;SQL,True,-1.395522,0.495652,1.052626
4,5,C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA,False,-2.854811,1.672078,-0.418606

# selecting rows and columns

In [1468]:
# some idea how might pandas work

# here the keys might serve as name of columns and indexes of values (lists) as rows
custom_dict = {"name": ["Jon", "Ponna", "Lada"],
               "age": [20, 32, 23],
               "sex": ["Male", "Female", "Female"]}

custom_dict["name"]

['Jon', 'Ponna', 'Lada']

In [1469]:
# try to load custom data to pandas

custom_df = pd.DataFrame(custom_dict)
custom_df

    name  age     sex
0    Jon   20    Male
1  Ponna   32  Female
2   Lada   23  Female

In [1470]:
# acces column

# it returns the same data as the basic dictionary above, but in pandas format
custom_df["name"]

0      Jon
1    Ponna
2     Lada
Name: name, dtype: object

In [1471]:
# access column, option 2 
# (df.columnname might cause errors, it might get confused with some method)
custom_df.name

0      Jon
1    Ponna
2     Lada
Name: name, dtype: object

In [1472]:
# access more columns
custom_df[["name", "sex"]]

    name     sex
0    Jon    Male
1  Ponna  Female
2   Lada  Female

In [1473]:
# get name of columns
custom_df.columns

Index(['name', 'age', 'sex'], dtype='object')

In [1474]:
# get columns and rows using "iloc" (integer location)

# access row
custom_df.iloc[0] # acces by integer location

name     Jon
age       20
sex     Male
Name: 0, dtype: object

In [1475]:
# access multiple rows
custom_df.iloc[[0, 2]]

   name  age     sex
0   Jon   20    Male
2  Lada   23  Female

In [1476]:
# access (with coordinates) with iloc specified row/s and column/s
print(custom_df)
print(custom_df.iloc[0, -1]) # access first row, last column

    name  age     sex
0    Jon   20    Male
1  Ponna   32  Female
2   Lada   23  Female
Male

In [1477]:
# more rows, and columns
custom_df.iloc[[1, 2], [1, 2]] # access only 2nd & 3rd row + 2nd & 3rd column

   age     sex
1   32  Female
2   23  Female

In [1478]:
# slicing is possible, square brackets must not be used
custom_df.iloc[1:3, 1:3]

   age     sex
1   32  Female
2   23  Female

In [1479]:
# get columns and rows using "loc" (search by name of row/column)
# seems that rows are also accessed by integers, but to filter name of 
#   column at the same time, name of column can be given, instead of integer
print(custom_df, end="\n"*2)

print(custom_df.iloc[0]) # acces everything at first row

    name  age     sex
0    Jon   20    Male
1  Ponna   32  Female
2   Lada   23  Female

name     Jon
age       20
sex     Male
Name: 0, dtype: object

In [1480]:
# access more rows
custom_df.loc[[0, 2]]

   name  age     sex
0   Jon   20    Male
2  Lada   23  Female

In [1481]:
# acces items based on row and name of column
custom_df.loc[[1, 2], ["sex", "age"]] # select second and third row, and columns by their name

      sex  age
1  Female   32
2  Female   23

In [1482]:
# check names of all columns in a dataset
df.columns

Index(['Responder_id', 'LanguagesWorkedWith', 'some_column1', 'some_column2',
       'some_column3', 'some_column4'],
      dtype='object')

In [1483]:
# check value counts of our custom bool values column
df["some_column1"].value_counts()

True     43855
False    43714
Name: some_column1, dtype: int64

In [1484]:
# slice through columns
# it is not possible to do it only via square brackets. iloc or loc has to be used, and
#   rows can be ommited by colon ":" 
df.loc[0, "some_column1":"some_column3"]

some_column1       False
some_column2   -0.467252
some_column3   -0.579881
Name: 0, dtype: object

In [1485]:
df.loc[:, "some_column1":"some_column3"]

       some_column1  some_column2  some_column3
0             False     -0.467252     -0.579881
1             False      0.879021      1.336515
2              True     -0.918523     -1.037106
3              True     -1.395522      0.495652
4             False     -2.854811      1.672078
...             ...           ...           ...
87564         False     -0.335120     -0.468943
87565          True      0.006329     -0.232168
87566          True     -0.424559      0.067616
87567          True     -1.595947      0.897649
87568          True     -2.222943     -1.031083

[87569 rows x 3 columns]

# How to Set, Reset, and Use Indexes

In [1486]:
custom_dict2 = {"name": ["Jon", "Ponna", "Lada", "Jožo", "Prlajz"],
                "last name": ["Bobo", "Wale", "Boro", "Zajeci", ""],
               "age": [20, 32, 23, 50, 34],
               "sex": ["Male", "Female", "Female", "Male", "Dog"],
               "email": ["JJ@email.com", "pony@gmail.com", "borovice@seznam.cz", np.nan, np.nan],
               "bills": [1000, 2000, 1000, 400, 800],
               "salary": [20000, 25000, 40000, 18000, 19000],
               "country": ["USA", "Germany", "Czechia", "Slovakia", "Poland"]}

In [1487]:
custom_df2 = pd.DataFrame(custom_dict2)
custom_df2

     name last name  age     sex               email  bills  salary   country
0     Jon      Bobo   20    Male        JJ@email.com   1000   20000       USA
1   Ponna      Wale   32  Female      pony@gmail.com   2000   25000   Germany
2    Lada      Boro   23  Female  borovice@seznam.cz   1000   40000   Czechia
3    Jožo    Zajeci   50    Male                 NaN    400   18000  Slovakia
4  Prlajz             34     Dog                 NaN    800   19000    Poland

In [1488]:
# set email addresses from above dataset as an index (names/labels of rows) of dataset
# with this we could use dataframe.loc to search by row name by email

# both rows do the same
"""custom_df2 = custom_df2.set_index("email")"""
custom_df2.set_index("email", inplace=True)

custom_df2

                      name last name  age     sex  bills  salary   country
email
JJ@email.com           Jon      Bobo   20    Male   1000   20000       USA
pony@gmail.com       Ponna      Wale   32  Female   2000   25000   Germany
borovice@seznam.cz    Lada      Boro   23  Female   1000   40000   Czechia
NaN                   Jožo    Zajeci   50    Male    400   18000  Slovakia
NaN                 Prlajz             34     Dog    800   19000    Poland

In [1489]:
# check values by indexes
print(custom_df2.index) # name of rows
print()
print(custom_df2.sort_index(ascending=False, inplace=False)) # name of rows sorted, descending
print()
print(custom_df2.columns) # name of columns

Index(['JJ@email.com', 'pony@gmail.com', 'borovice@seznam.cz', nan, nan], dtype='object', name='email')

                      name last name  age     sex  bills  salary   country
email
pony@gmail.com       Ponna      Wale   32  Female   2000   25000   Germany
borovice@seznam.cz    Lada      Boro   23  Female   1000   40000   Czechia
JJ@email.com           Jon      Bobo   20    Male   1000   20000       USA
NaN                   Jožo    Zajeci   50    Male    400   18000  Slovakia
NaN                 Prlajz             34     Dog    800   19000    Poland

Index(['name', 'last name', 'age', 'sex', 'bills', 'salary', 'country'], dtype='object')

In [1490]:
custom_df2.loc["JJ@email.com"]

name           Jon
last name     Bobo
age             20
sex           Male
bills         1000
salary       20000
country        USA
Name: JJ@email.com, dtype: object

In [1491]:
# return row names / indexes back to original values
custom_df2.reset_index(inplace=True)
custom_df2

                email    name last name  age     sex  bills  salary   country
0        JJ@email.com     Jon      Bobo   20    Male   1000   20000       USA
1      pony@gmail.com   Ponna      Wale   32  Female   2000   25000   Germany
2  borovice@seznam.cz    Lada      Boro   23  Female   1000   40000   Czechia
3                 NaN    Jožo    Zajeci   50    Male    400   18000  Slovakia
4                 NaN  Prlajz             34     Dog    800   19000    Poland

# Using Conditionals to Filter Rows and Columns
& = AND;
| = OR;
~ = NOT;

In [1492]:
# filter out only people that are Female
filter1 = (custom_df2["sex"] == "Female")

custom_df2[filter1]

                email   name last name  age     sex  bills  salary  country
1      pony@gmail.com  Ponna      Wale   32  Female   2000   25000  Germany
2  borovice@seznam.cz   Lada      Boro   23  Female   1000   40000  Czechia

In [1493]:
# also possible to to the same with "loc"
# loc will allow us more options, like also filter columns etc
custom_df2.loc[filter1]

                email   name last name  age     sex  bills  salary  country
1      pony@gmail.com  Ponna      Wale   32  Female   2000   25000  Germany
2  borovice@seznam.cz   Lada      Boro   23  Female   1000   40000  Czechia

In [1494]:
# filter emails of all females
custom_df2.loc[filter1, "email"]

1        pony@gmail.com
2    borovice@seznam.cz
Name: email, dtype: object

In [1495]:
# filter with more conditions
# (& = AND) (| = OR)

# filter everyone who meets atleast one of these conditions
filter2 = (custom_df2["name"] == "Jon") | (custom_df2["bills"] == 1000)

custom_df2.loc[filter2]

                email  name last name  age     sex  bills  salary  country
0        JJ@email.com   Jon      Bobo   20    Male   1000   20000      USA
2  borovice@seznam.cz  Lada      Boro   23  Female   1000   40000  Czechia

In [1496]:
# filter everyone who meets exactly those two conditions
filter3 = (custom_df2["name"] == "Jon") & (custom_df2["bills"] == 1000)

custom_df2.loc[filter3]

          email name last name  age   sex  bills  salary country
0  JJ@email.com  Jon      Bobo   20  Male   1000   20000     USA

In [1497]:
# filter everyone who DOES NOT meets exactly those two conditions
# ~ sign

filter4 = ~(custom_df2["name"] == "Jon") & ~(custom_df2["bills"] == 1000)

custom_df2.loc[filter4]

            email    name last name  age     sex  bills  salary   country
1  pony@gmail.com   Ponna      Wale   32  Female   2000   25000   Germany
3             NaN    Jožo    Zajeci   50    Male    400   18000  Slovakia
4             NaN  Prlajz             34     Dog    800   19000    Poland

In [1498]:
# filter everyone with bills higher than 1000,

# < > operator

filter5 = custom_df2["bills"] > 1000
custom_df2.loc[filter5]

            email   name last name  age     sex  bills  salary  country
1  pony@gmail.com  Ponna      Wale   32  Female   2000   25000  Germany

In [1499]:
# filter everyone with salary below 20000 and from Czechia, Slovakia and Poland

countries = ["Czechia", "Slovakia", "Poland"]

filter_6a = custom_df2["salary"] < 20_000
filter_6b = custom_df2["country"].isin(countries) # filter all rows that have specified countires
filter6 = filter_6a & filter_6b

custom_df2.loc[filter6]

  email    name last name  age   sex  bills  salary   country
3   NaN    Jožo    Zajeci   50  Male    400   18000  Slovakia
4   NaN  Prlajz             34   Dog    800   19000    Poland

In [1500]:
# filer only rows that contain a given string

# na = do not return values that have N/A in a given specification
filter7 = custom_df2["country"].str.contains("ia", na=False)

custom_df2.loc[filter7]

                email  name last name  age     sex  bills  salary   country
2  borovice@seznam.cz  Lada      Boro   23  Female   1000   40000   Czechia
3                 NaN  Jožo    Zajeci   50    Male    400   18000  Slovakia

# Updating Rows and Columns - Modifying Data Within DataFrames

In [1501]:
custom_df2.columns

Index(['email', 'name', 'last name', 'age', 'sex', 'bills', 'salary',
       'country'],
      dtype='object')

In [1502]:
# update names of all column names to uppercase

custom_df2.columns = [name.title() for name in custom_df2.columns]
custom_df2.columns

Index(['Email', 'Name', 'Last Name', 'Age', 'Sex', 'Bills', 'Salary',
       'Country'],
      dtype='object')

In [1503]:
# rename column / columns

custom_df2.rename(columns={"Email": "Mail", "Name": "First_name"}, inplace=True)
custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,JJ@email.com,Jon,Bobo,20,Male,1000,20000,USA
1,pony@gmail.com,Ponna,Wale,32,Female,2000,25000,Germany
2,borovice@seznam.cz,Lada,Boro,23,Female,1000,40000,Czechia
3,NaN,Jožo,Zajeci,50,Male,400,18000,Slovakia
4,NaN,Prlajz,,34,Dog,800,19000,Poland

In [1504]:
# change a some singl value in a dataset

# change Jožos salary to 18500

filter8 = custom_df2["First_name"].str.contains("Jožo")

custom_df2.loc[filter8, "Salary"] = 18500
custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,JJ@email.com,Jon,Bobo,20,Male,1000,20000,USA
1,pony@gmail.com,Ponna,Wale,32,Female,2000,25000,Germany
2,borovice@seznam.cz,Lada,Boro,23,Female,1000,40000,Czechia
3,NaN,Jožo,Zajeci,50,Male,400,18500,Slovakia
4,NaN,Prlajz,,34,Dog,800,19000,Poland

In [1505]:
# change whole row

# have to assign a value to each column of a given row
custom_df2.iloc[0] = ["Jonny@email.com", "Jon", "Bobo", 21, "Male", 1400, 22000, "USA"]
custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,Jonny@email.com,Jon,Bobo,21,Male,1400,22000,USA
1,pony@gmail.com,Ponna,Wale,32,Female,2000,25000,Germany
2,borovice@seznam.cz,Lada,Boro,23,Female,1000,40000,Czechia
3,NaN,Jožo,Zajeci,50,Male,400,18500,Slovakia
4,NaN,Prlajz,,34,Dog,800,19000,Poland

In [1506]:
# Change all values of a given column - integers

custom_df2["Salary"] = custom_df2["Salary"] + 10_000
custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,Jonny@email.com,Jon,Bobo,21,Male,1400,32000,USA
1,pony@gmail.com,Ponna,Wale,32,Female,2000,35000,Germany
2,borovice@seznam.cz,Lada,Boro,23,Female,1000,50000,Czechia
3,NaN,Jožo,Zajeci,50,Male,400,28500,Slovakia
4,NaN,Prlajz,,34,Dog,800,29000,Poland

In [1507]:
# change all values of a given column - strings

custom_df2["Sex"] = custom_df2["Sex"].str.lower()
custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,Jonny@email.com,Jon,Bobo,21,male,1400,32000,USA
1,pony@gmail.com,Ponna,Wale,32,female,2000,35000,Germany
2,borovice@seznam.cz,Lada,Boro,23,female,1000,50000,Czechia
3,NaN,Jožo,Zajeci,50,male,400,28500,Slovakia
4,NaN,Prlajz,,34,dog,800,29000,Poland

#### apply
use any ***function()*** that will be applied on each value of a given column

- can be used both on series and on dataframes

In [1508]:
# use it on a series

custom_df2["Country"].apply(len)

0    3
1    7
2    7
3    8
4    6
Name: Country, dtype: int64

In [1509]:
# use it on a series

def make_upper_case(parameter):
  return parameter.upper()

custom_df2["Country"] = custom_df2["Country"].apply(make_upper_case)

# also possible with lambda
custom_df2["Sex"] = custom_df2["Sex"].apply(lambda parameter: parameter.title())

custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,Jonny@email.com,Jon,Bobo,21,Male,1400,32000,USA
1,pony@gmail.com,Ponna,Wale,32,Female,2000,35000,GERMANY
2,borovice@seznam.cz,Lada,Boro,23,Female,1000,50000,CZECHIA
3,NaN,Jožo,Zajeci,50,Male,400,28500,SLOVAKIA
4,NaN,Prlajz,,34,Dog,800,29000,POLAND

In [1510]:
# use it on a dataframe

# this will return length of each series in a given dataframe
print(custom_df2.apply(len, axis="rows"))
print()
print(custom_df2.apply(len, axis="columns"))

Mail          5
First_name    5
Last Name     5
Age           5
Sex           5
Bills         5
Salary        5
Country       5
dtype: int64

0    8
1    8
2    8
3    8
4    8
dtype: int64

#### apply map
this will work for each single value in series on the whole dataframe

In [1511]:

# drop columns with n/a values and integers because len() would not work on that
custom_df3 = custom_df2.drop(index=[3, 4], columns=["Bills", "Salary", "Age"]) 

# custom_df3
custom_df3.applymap(len)

   Mail  First_name  Last Name  Sex  Country
0    15           3          4    4        3
1    14           5          4    6        7
2    18           4          4    6        7

In [1512]:
# make all string values of dataframe lower. (integers and na values have to be dorpped)
custom_df3.applymap(str.lower)

                 Mail First_name Last Name     Sex  Country
0     jonny@email.com        jon      bobo    male      usa
1      pony@gmail.com      ponna      wale  female  germany
2  borovice@seznam.cz       lada      boro  female  czechia

### map
works only on series. Map is used to replace given values by another given values in a siries

In [1513]:
custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,Jonny@email.com,Jon,Bobo,21,Male,1400,32000,USA
1,pony@gmail.com,Ponna,Wale,32,Female,2000,35000,GERMANY
2,borovice@seznam.cz,Lada,Boro,23,Female,1000,50000,CZECHIA
3,NaN,Jožo,Zajeci,50,Male,400,28500,SLOVAKIA
4,NaN,Prlajz,,34,Dog,800,29000,POLAND

In [1514]:
# replace every specified occurence, not specified occurences will be converted to N/A
custom_df4 = custom_df2.copy()
custom_df4["Sex"] = custom_df4["Sex"].map({"Male": "Chlap", "Female": "Zenska"})
custom_df4

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,Jonny@email.com,Jon,Bobo,21,Chlap,1400,32000,USA
1,pony@gmail.com,Ponna,Wale,32,Zenska,2000,35000,GERMANY
2,borovice@seznam.cz,Lada,Boro,23,Zenska,1000,50000,CZECHIA
3,NaN,Jožo,Zajeci,50,Chlap,400,28500,SLOVAKIA
4,NaN,Prlajz,,34,NaN,800,29000,POLAND

In [1515]:
# replace only specified occurences, not specified occurences will remain the same
custom_df5 = custom_df2.copy()
custom_df5["Sex"] = custom_df5["Sex"].replace({"Male": "Chlap", "Female": "Zenska"})
custom_df5

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country
0,Jonny@email.com,Jon,Bobo,21,Chlap,1400,32000,USA
1,pony@gmail.com,Ponna,Wale,32,Zenska,2000,35000,GERMANY
2,borovice@seznam.cz,Lada,Boro,23,Zenska,1000,50000,CZECHIA
3,NaN,Jožo,Zajeci,50,Chlap,400,28500,SLOVAKIA
4,NaN,Prlajz,,34,Dog,800,29000,POLAND

# Add/Remove Rows and Columns From DataFrames

In [1516]:
# add a new row as a combination of existing ones
custom_df2["Full name"] = custom_df2["First_name"] + " " + custom_df2["Last Name"]
custom_df2

,Mail,First_name,Last Name,Age,Sex,Bills,Salary,Country,Full name
0,Jonny@email.com,Jon,Bobo,21,Male,1400,32000,USA,Jon Bobo
1,pony@gmail.com,Ponna,Wale,32,Female,2000,35000,GERMANY,Ponna Wale
2,borovice@seznam.cz,Lada,Boro,23,Female,1000,50000,CZECHIA,Lada Boro
3,NaN,Jožo,Zajeci,50,Male,400,28500,SLOVAKIA,Jožo Zajeci
4,NaN,Prlajz,,34,Dog,800,29000,POLAND,Prlajz

In [1517]:
# remove columns

custom_df2.drop(columns=["First_name", "Last Name"], inplace=True)
custom_df2

                 Mail  Age     Sex  Bills  Salary   Country    Full name
0     Jonny@email.com   21    Male   1400   32000       USA     Jon Bobo
1      pony@gmail.com   32  Female   2000   35000   GERMANY   Ponna Wale
2  borovice@seznam.cz   23  Female   1000   50000   CZECHIA    Lada Boro
3                 NaN   50    Male    400   28500  SLOVAKIA  Jožo Zajeci
4                 NaN   34     Dog    800   29000    POLAND      Prlajz

In [1518]:
# split existing column into multiple new columns

# operation at right side of '=' splits each string item into two items in a list, expand True
#   makes from this a pandas dataframe of two columns that are later assigned to their names
#   specified of the left side
custom_df2[["first name", "last name"]] = custom_df2["Full name"].str.split(" ", expand=True)
custom_df2

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21,Male,1400,32000,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32,Female,2000,35000,GERMANY,Ponna Wale,Ponna,Wale
2,borovice@seznam.cz,23,Female,1000,50000,CZECHIA,Lada Boro,Lada,Boro
3,NaN,50,Male,400,28500,SLOVAKIA,Jožo Zajeci,Jožo,Zajeci
4,NaN,34,Dog,800,29000,POLAND,Prlajz,Prlajz,

# add and remove rows

In [1519]:
# add a new row, with only one value specified
custom_df2.append({"Full name": "Vjenc Stejskalu"}, ignore_index=True)

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,NaN,50.0,Male,400.0,28500.0,SLOVAKIA,Jožo Zajeci,Jožo,Zajeci
4,NaN,34.0,Dog,800.0,29000.0,POLAND,Prlajz,Prlajz,
5,NaN,NaN,NaN,NaN,NaN,NaN,Vjenc Stejskalu,NaN,NaN

In [1520]:
# append a whole dataset
custom_df6 = {"first name": ["Ragos", "Edward"],
              "Age": [99, 100]}
custom_df6 = pd.DataFrame(custom_df6)

custom_df2 = custom_df2.append(custom_df6, ignore_index=True)
custom_df2

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
2,borovice@seznam.cz,23,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,NaN,50,Male,400.0,28500.0,SLOVAKIA,Jožo Zajeci,Jožo,Zajeci
4,NaN,34,Dog,800.0,29000.0,POLAND,Prlajz,Prlajz,
5,NaN,99,NaN,NaN,NaN,NaN,NaN,Ragos,NaN
6,NaN,100,NaN,NaN,NaN,NaN,NaN,Edward,NaN

In [1521]:
# drop a row/rows
custom_df2.drop(index=[5, 6], inplace=True)
custom_df2

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
2,borovice@seznam.cz,23,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,NaN,50,Male,400.0,28500.0,SLOVAKIA,Jožo Zajeci,Jožo,Zajeci
4,NaN,34,Dog,800.0,29000.0,POLAND,Prlajz,Prlajz,

In [1522]:
# drop rows with filter (similar like filtering with iloc/loc etc...)
filter = custom_df2["Salary"] < 30_000
custom_df2.drop(custom_df2[filter].index, inplace=True)
custom_df2

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
2,borovice@seznam.cz,23,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro

# sorting data

In [1523]:
# sort data at a given column
custom_df2 = custom_df2.append({"Bills": 1000, "Age": 40}, ignore_index=True) # add extra row for later use
custom_df2 = custom_df2.append({"Bills": 1000, "Age": 36}, ignore_index=True) # add extra row for later use
custom_df2.sort_values(by="Bills", ascending=True)

custom_df2

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,NaN,40.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN
4,NaN,36.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN

In [1524]:
# sort data based on multiple columns 
#   (once more rows have the same value, data will be sorted based on next column)

# if you want to have sorted by specified columns and have different orders (ascend./descend)
#   for each one, add a list of bools into ascending parameter 
custom_df2.sort_values(by=["Bills", "Age"], ascending=[False, True], inplace=True)

In [1525]:
# sort back based on number of index column
custom_df2.sort_index()

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,NaN,40.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN
4,NaN,36.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN

In [1526]:
# sort simply just one column
custom_df2["Salary"].sort_index()

0    32000.0
1    35000.0
2    50000.0
3        NaN
4        NaN
Name: Salary, dtype: float64

In [1527]:
# get largest value (or number of them) from a series
custom_df2["Salary"].nlargest(2)

2    50000.0
1    35000.0
Name: Salary, dtype: float64

In [1528]:
# get largest value of a series but return whole dataset
custom_df2.nlargest(2, "Salary")

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
1,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale

In [1529]:
# smallest numbers (just rlly oposite of nlargest)
custom_df2.nsmallest(2, "Salary")

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
1,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale

# Grouping and Aggregating - Analyzing and Exploring Your Data
aggregation = combining multiple parts of data into single result (mean, median...)

In [1530]:
df = pd.read_csv("https://raw.githubusercontent.com/Ismaril/training/main/Machine%20learning%20Deep%20learning/csv%20files/Data%20Science%20Jobs%20Salaries.csv")
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021e,EN,FT,Data Science Consultant,54000,EUR,64369,DE,50,DE,L
1,2020,SE,FT,Data Scientist,60000,EUR,68428,GR,100,US,L
2,2021e,EX,FT,Head of Data Science,85000,USD,85000,RU,0,RU,M
3,2021e,EX,FT,Head of Data,230000,USD,230000,RU,50,RU,L
4,2021e,EN,FT,Machine Learning Engineer,125000,USD,125000,US,100,US,S

In [1531]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           245 non-null    object
 1   experience_level    245 non-null    object
 2   employment_type     245 non-null    object
 3   job_title           245 non-null    object
 4   salary              245 non-null    int64
 5   salary_currency     245 non-null    object
 6   salary_in_usd       245 non-null    int64
 7   employee_residence  245 non-null    object
 8   remote_ratio        245 non-null    int64
 9   company_location    245 non-null    object
 10  company_size        245 non-null    object
dtypes: int64(3), object(8)
memory usage: 21.2+ KB

In [1532]:
# median (ignores na values)
df.median()

C:\Users\lazni\AppData\Local\Temp\ipykernel_2412\3516113453.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

salary           103000.0
salary_in_usd     81000.0
remote_ratio        100.0
dtype: float64

In [1533]:
# describe, some useful statistics info
# count = number of not NAN rows
df.describe().T

,count,mean,std,min,25%,50%,75%,max
salary,245.0,502541.812245,2.276230e+06,4000.0,60000.0,103000.0,174000.0,30400000.0
salary_in_usd,245.0,99868.012245,8.398333e+04,2876.0,45896.0,81000.0,130000.0,600000.0
remote_ratio,245.0,69.183673,3.759342e+01,0.0,50.0,100.0,100.0,100.0

In [1534]:
df["salary"].describe()

count    2.450000e+02
mean     5.025418e+05
std      2.276230e+06
min      4.000000e+03
25%      6.000000e+04
50%      1.030000e+05
75%      1.740000e+05
max      3.040000e+07
Name: salary, dtype: float64

In [1535]:
# summary of certain values in a given column
df["employment_type"].value_counts()

FT    231
PT      7
CT      4
FL      3
Name: employment_type, dtype: int64

In [1536]:
# summary of certain values in a given column as percentage
df["employment_type"].value_counts(normalize=True)

FT    0.942857
PT    0.028571
CT    0.016327
FL    0.012245
Name: employment_type, dtype: float64

In [1537]:
# groupby = spliting the data, applying a function, combining the results


# group by employee residence
country_group = df.groupby(["employee_residence"])

# visualise (actually this will return the same result as if we filtered it with loc iloc)
country_group.get_group("US").head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
4,2021e,EN,FT,Machine Learning Engineer,125000,USD,125000,US,100,US,S
5,2021e,SE,FT,Data Analytics Manager,120000,USD,120000,US,100,US,M
6,2020,MI,FT,Research Scientist,450000,USD,450000,US,0,US,M

In [1538]:
country_group["salary_in_usd"].median().head()

employee_residence
AE    115000.0
AT     82683.5
BE     89402.0
BG     80000.0
BR     16026.0
Name: salary_in_usd, dtype: float64

In [1539]:
# use aggregate function to apply multiple functions on a given 'groupby' dataset
country_group["salary_in_usd"].agg(["median", "min"]).head()

                      median     min
employee_residence
AE                  115000.0  115000
AT                   82683.5   74130
BE                   89402.0   89402
BG                   80000.0   80000
BR                   16026.0   12000

In [1540]:
# check only US
country_group["salary_in_usd"].agg(["median", "min"]).loc["US"]

median    138175.0
min        58000.0
Name: US, dtype: float64

In [1541]:
# filter out sum of number of reasearches by country

# note that on group object, you have to use apply method and inside it a function
_ = country_group["job_title"].apply(lambda x: x.str.contains("Research").sum())

df_ = _.copy()
# filter out rows that do not have researchers
filter = _ != False
_.loc[filter]

employee_residence
CA    3
FR    2
GB    1
IN    1
JE    1
NL    1
PT    1
US    1
Name: job_title, dtype: int64

# Cleaning Data - Casting Datatypes and Handling Missing Values

In [1542]:
df = custom_df2.append({"first name":"Kuro",
                        "Mail": "NA",
                        "Age": "NA",
                        "Sex": "NA",
                        "Salary": "NA",
                        "Country": "NA",
                        "Full name": "missing",
                        "last name": "missing",
                        "Bills": "missing"}, ignore_index=True)
df = df.append({"first name":"Zdeno", "Mail": "Missing"}, ignore_index=True)
df = df.append({"first name":"Jaro","Age": None, "Country": None}, ignore_index=True)

df

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
1,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,NaN,36.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN
4,NaN,40.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN
5,NA,NA,NA,missing,NA,NA,missing,Kuro,missing
6,Missing,NaN,NaN,NaN,NaN,NaN,NaN,Zdeno,NaN
7,NaN,None,NaN,NaN,NaN,None,NaN,Jaro,NaN

In [1543]:
df.dropna()

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
1,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
5,NA,NA,NA,missing,NA,NA,missing,Kuro,missing

In [1544]:
# default parameters in dropna()
# axis = index/columns - drop index or column if it has any na value
# how = all/any - drop row/column based if there is atleast one na or all na values
df.dropna(axis="index", how="any")

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
1,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
5,NA,NA,NA,missing,NA,NA,missing,Kuro,missing

In [1545]:
# drop na based on specified column (also row?)
#   means drop only na in a specified column
df.dropna(axis="index", how="any", subset=["Mail"])

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
1,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
5,NA,NA,NA,missing,NA,NA,missing,Kuro,missing
6,Missing,NaN,NaN,NaN,NaN,NaN,NaN,Zdeno,NaN

In [1546]:
# replace values "NA", "missing" with np.nan
# df.replace applies on every value of the dataset
df.replace("NA", np.nan, inplace=True)
df.replace("missing", np.nan, inplace=True)
df

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
1,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,NaN,36.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN
4,NaN,40.0,NaN,1000.0,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Kuro,NaN
6,Missing,NaN,NaN,NaN,NaN,NaN,NaN,Zdeno,NaN
7,NaN,NaN,NaN,NaN,NaN,None,NaN,Jaro,NaN

In [1547]:
# check if any value in dataset is na with df.isna()
df.isna()

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,True,False,True,False,True,True,True,True,True
4,True,False,True,False,True,True,True,True,True
5,True,True,True,True,True,True,True,False,True
6,False,True,True,True,True,True,True,False,True
7,True,True,True,True,True,True,True,False,True

In [1548]:
# we can also replace all na values with whaver we like (just for any reason...)
df.fillna("MISSING")

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
1,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,MISSING,36.0,MISSING,1000.0,MISSING,MISSING,MISSING,MISSING,MISSING
4,MISSING,40.0,MISSING,1000.0,MISSING,MISSING,MISSING,MISSING,MISSING
5,MISSING,MISSING,MISSING,MISSING,MISSING,MISSING,MISSING,Kuro,MISSING
6,Missing,MISSING,MISSING,MISSING,MISSING,MISSING,MISSING,Zdeno,MISSING
7,MISSING,MISSING,MISSING,MISSING,MISSING,MISSING,MISSING,Jaro,MISSING

In [1549]:
# ...of fill in some zeroes instead
df.fillna(0)

,Mail,Age,Sex,Bills,Salary,Country,Full name,first name,last name
0,pony@gmail.com,32.0,Female,2000.0,35000.0,GERMANY,Ponna Wale,Ponna,Wale
1,Jonny@email.com,21.0,Male,1400.0,32000.0,USA,Jon Bobo,Jon,Bobo
2,borovice@seznam.cz,23.0,Female,1000.0,50000.0,CZECHIA,Lada Boro,Lada,Boro
3,0,36.0,0,1000.0,0.0,0,0,0,0
4,0,40.0,0,1000.0,0.0,0,0,0,0
5,0,0.0,0,0.0,0.0,0,0,Kuro,0
6,Missing,0.0,0,0.0,0.0,0,0,Zdeno,0
7,0,0.0,0,0.0,0.0,0,0,Jaro,0

# Casting datatypes

In [1550]:
# check for datatypes of dataset
df.dtypes

Mail           object
Age           float64
Sex            object
Bills         float64
Salary        float64
Country        object
Full name      object
first name     object
last name      object
dtype: object

In [1551]:
# change datatype of each value
#   be careful not to change datatypes that make sense, like nan to str etc... 
# changing numbers with some nan values to float is possible because nan is actually float

# it will display an error as demonstration
"""df["Age"] = df["Age"].astype(int)
df.dtypes"""

'df["Age"] = df["Age"].astype(int)\ndf.dtypes'

In [1552]:
df["Age"] = df["Age"].astype(float)
df["Age"].dtype

dtype('float64')

In [1553]:
# check all unique values of a given column (similar to values counts)
df["Country"].unique()

array(['GERMANY', 'USA', 'CZECHIA', nan, None], dtype=object)

# Working with Dates and Time Series Data

In [1554]:
# in case we want to convert some dates immediatelly when we are reading in a file, we can specify it in the read.csv method.
#   For that we must specify which columns to be parsed and a function that will perform the formating (if the original data are not in readable format to pandas)
data = "https://raw.githubusercontent.com/CoreyMSchafer/code_snippets/master/Python/Pandas/10-Datetime-Timeseries/ETH_1h.csv"
"""d_parser = lambda x: pd.datetime.strptime(x, "%Y-%m-%d %I-%p")
df = pf.read_csv(data, parse_dates=["Date"], date_parser=d_parser)"""

# read just regulary
df = pd.read_csv(data)

In [1555]:
df.head()

               Date  Symbol    Open    High     Low   Close      Volume
0  2020-03-13 08-PM  ETHUSD  129.94  131.82  126.87  128.71  1940673.93
1  2020-03-13 07-PM  ETHUSD  119.51  132.02  117.10  129.94  7579741.09
2  2020-03-13 06-PM  ETHUSD  124.47  124.85  115.50  119.51  4898735.81
3  2020-03-13 05-PM  ETHUSD  124.08  127.42  121.63  124.47  2753450.92
4  2020-03-13 04-PM  ETHUSD  124.85  129.51  120.17  124.08  4461424.71

In [1556]:
# to access the date time value of a dataset we have to conert it to datetime format, because it might only be string
type(df.loc[0, "Date"])

str

In [1557]:
# usually pandas might not be able to figure out the format, so we have to specify it using python/pandas documentation
# format it like this in this case: format="%Y-%m-%d %I-%p"
df["Date"] = pd.to_datetime(df["Date"], format="%Y-%m-%d %I-%p")
type(df.loc[0, "Date"]), df["Date"]

(pandas._libs.tslibs.timestamps.Timestamp,
 0       2020-03-13 20:00:00
 1       2020-03-13 19:00:00
 2       2020-03-13 18:00:00
 3       2020-03-13 17:00:00
 4       2020-03-13 16:00:00
                 ...
 23669   2017-07-01 15:00:00
 23670   2017-07-01 14:00:00
 23671   2017-07-01 13:00:00
 23672   2017-07-01 12:00:00
 23673   2017-07-01 11:00:00
 Name: Date, Length: 23674, dtype: datetime64[ns])

In [1558]:
# we can check for exact day 
df.loc[0, "Date"].day_name()

'Friday'

In [1559]:
# access certain methods from "dt" class
df["Date"].dt.day_name()

0          Friday
1          Friday
2          Friday
3          Friday
4          Friday
           ...
23669    Saturday
23670    Saturday
23671    Saturday
23672    Saturday
23673    Saturday
Name: Date, Length: 23674, dtype: object

In [1560]:
# check what is the earliest/ latest date
df["Date"].min(), df["Date"].max()

(Timestamp('2017-07-01 11:00:00'), Timestamp('2020-03-13 20:00:00'))

In [1561]:
# calculate time delta (difference between two times)
df["Date"].max() - df["Date"].min()

Timedelta('986 days 09:00:00')

In [1562]:
# filter dates based on your needs
filter_ = (df["Date"] >= "2019") & (df["Date"] <= "2020")
df.loc[filter_]

                     Date  Symbol    Open    High     Low   Close      Volume
1748  2020-01-01 00:00:00  ETHUSD  128.54  128.54  128.12  128.34   245119.91
1749  2019-12-31 23:00:00  ETHUSD  128.33  128.69  128.14  128.54   440678.91
1750  2019-12-31 22:00:00  ETHUSD  128.38  128.69  127.95  128.33   554646.02
1751  2019-12-31 21:00:00  ETHUSD  127.86  128.43  127.72  128.38   350155.69
1752  2019-12-31 20:00:00  ETHUSD  127.84  128.34  127.71  127.86   428183.38
...                   ...     ...     ...     ...     ...     ...         ...
10504 2019-01-01 04:00:00  ETHUSD  130.75  133.96  130.74  131.96  2791135.37
10505 2019-01-01 03:00:00  ETHUSD  130.06  130.79  130.06  130.75   503732.63
10506 2019-01-01 02:00:00  ETHUSD  130.79  130.88  129.55  130.06   838183.43
10507 2019-01-01 01:00:00  ETHUSD  131.62  131.62  130.77  130.79   434917.99
10508 2019-01-01 00:00:00  ETHUSD  130.53  131.91  130.48  131.62  1067136.21

[8761 rows x 7 columns]

In [1563]:
# also possible to use datetimes in filters, instead of strings (smae result as above)
filter_ = (df["Date"] >= pd.to_datetime("2019")) & (df["Date"] <= pd.to_datetime("2020"))
df.loc[filter_]

                     Date  Symbol    Open    High     Low   Close      Volume
1748  2020-01-01 00:00:00  ETHUSD  128.54  128.54  128.12  128.34   245119.91
1749  2019-12-31 23:00:00  ETHUSD  128.33  128.69  128.14  128.54   440678.91
1750  2019-12-31 22:00:00  ETHUSD  128.38  128.69  127.95  128.33   554646.02
1751  2019-12-31 21:00:00  ETHUSD  127.86  128.43  127.72  128.38   350155.69
1752  2019-12-31 20:00:00  ETHUSD  127.84  128.34  127.71  127.86   428183.38
...                   ...     ...     ...     ...     ...     ...         ...
10504 2019-01-01 04:00:00  ETHUSD  130.75  133.96  130.74  131.96  2791135.37
10505 2019-01-01 03:00:00  ETHUSD  130.06  130.79  130.06  130.75   503732.63
10506 2019-01-01 02:00:00  ETHUSD  130.79  130.88  129.55  130.06   838183.43
10507 2019-01-01 01:00:00  ETHUSD  131.62  131.62  130.77  130.79   434917.99
10508 2019-01-01 00:00:00  ETHUSD  130.53  131.91  130.48  131.62  1067136.21

[8761 rows x 7 columns]

In [1564]:
# we can also set date as row index and filter directly on index
df.set_index("Date", inplace=True)
df.loc["2019"]  # filter out only index which contains 2019

                     Symbol    Open    High     Low   Close      Volume
Date
2019-12-31 23:00:00  ETHUSD  128.33  128.69  128.14  128.54   440678.91
2019-12-31 22:00:00  ETHUSD  128.38  128.69  127.95  128.33   554646.02
2019-12-31 21:00:00  ETHUSD  127.86  128.43  127.72  128.38   350155.69
2019-12-31 20:00:00  ETHUSD  127.84  128.34  127.71  127.86   428183.38
2019-12-31 19:00:00  ETHUSD  128.69  128.69  127.60  127.84  1169847.84
...                     ...     ...     ...     ...     ...         ...
2019-01-01 04:00:00  ETHUSD  130.75  133.96  130.74  131.96  2791135.37
2019-01-01 03:00:00  ETHUSD  130.06  130.79  130.06  130.75   503732.63
2019-01-01 02:00:00  ETHUSD  130.79  130.88  129.55  130.06   838183.43
2019-01-01 01:00:00  ETHUSD  131.62  131.62  130.77  130.79   434917.99
2019-01-01 00:00:00  ETHUSD  130.53  131.91  130.48  131.62  1067136.21

[8760 rows x 6 columns]

In [1567]:
# it is possible to use slices on dates
df.loc["2019-01-01 00:00:00":"2019-01-01 05:00:00"]

                     Symbol    Open    High     Low   Close      Volume
Date
2019-01-01 05:00:00  ETHUSD  131.96  132.58  131.96  132.48   317851.90
2019-01-01 04:00:00  ETHUSD  130.75  133.96  130.74  131.96  2791135.37
2019-01-01 03:00:00  ETHUSD  130.06  130.79  130.06  130.75   503732.63
2019-01-01 02:00:00  ETHUSD  130.79  130.88  129.55  130.06   838183.43
2019-01-01 01:00:00  ETHUSD  131.62  131.62  130.77  130.79   434917.99
2019-01-01 00:00:00  ETHUSD  130.53  131.91  130.48  131.62  1067136.21

In [1568]:
# get mean of a specified time range, of the column "Close"
# it is possible to use slices on dates
df.loc["2019-01-01 00:00:00":"2019-01-01 05:00:00", "Close"].mean()

131.27666666666667